# Ex - GroupBy

### Introduction:

GroupBy can be summarizes as Split-Apply-Combine.

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

Check out this [Diagram](http://i.imgur.com/yjNkiwL.png)  
### Step 1. Import the necessary libraries

Per realitzar l'exercici cal importar les llibreries <span style="color:#DF7401">**pandas**</span> i <span style="color:#DF7401">**numpy**</span>.

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from drinks.csv

### Step 3. Assign it to a variable called drinks.

En aquest exercici importarem el dataset directament de la carpeta on tenim les dades. Així, per importar el dataset i assignar-lo a la variable _drinks_ basta fer

In [2]:
drinks=pd.read_csv('data/drinks.csv')

Visualitzem les primeres observacions.

In [3]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

### Step 4. Which continent drinks more beer on average?

Per estudiar quin continent beu més cervesa en mitjana cal agrupar _drinks_ per continent, és a dir, per la columna <span style="color:#B43104">'continent'</span>. Per fer-ho, empram la funció _groupby()_.

In [4]:
continents_groups = drinks.groupby('continent')

Vegem quins continents diferents apareixen al nostre dataset.

In [5]:
continents_groups.groups.keys()

dict_keys(['AF', 'AS', 'EU', 'OC', 'SA'])

Notem que falta Amèrica del Nord, vegem si hi ha alguna observació sense cap valor en la columna <span style="color:#B43104">'continent'</span> i si n'hi ha, quines.

In [6]:
nan_continent=drinks['continent'].isnull()

print('Number of NaN in continent:', nan_continent.sum(), '.')
drinks[nan_continent][['country','continent']]

Number of NaN in continent: 23 .

                          country continent
5               Antigua & Barbuda       NaN
11                        Bahamas       NaN
14                       Barbados       NaN
17                         Belize       NaN
32                         Canada       NaN
41                     Costa Rica       NaN
43                           Cuba       NaN
50                       Dominica       NaN
51             Dominican Republic       NaN
54                    El Salvador       NaN
68                        Grenada       NaN
69                      Guatemala       NaN
73                          Haiti       NaN
74                       Honduras       NaN
84                        Jamaica       NaN
109                        Mexico       NaN
122                     Nicaragua       NaN
130                        Panama       NaN
143             St. Kitts & Nevis       NaN
144                     St. Lucia       NaN
145  St. Vincent & the Grenadines       NaN
174             Trinidad & Tobago       NaN
184                           USA       NaN

Tots els països obtinguts pertanyen a Amèrica del Nord. Així, podem completar el dataset per contestar la pregunta d'**Step 4** amb seguretat.

Abans de modificar _drinks_, guardam la informació en el dataframe *drinks_old*.

In [7]:
drinks_old=drinks

Ara, substituim cada ```NaN``` per ```'NA'```.

In [8]:
drinks['continent']=drinks['continent'].fillna('NA')

Vegem algunes de les files modificades.

In [9]:
drinks[nan_continent].head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
5,Antigua & Barbuda,102,128,45,4.9,NA
11,Bahamas,122,176,51,6.3,NA
14,Barbados,143,173,36,6.3,NA
17,Belize,263,114,8,6.8,NA
32,Canada,240,122,100,8.2,NA

D'aquesta manera, podem tornar a agrupar per continent i ara, sí surt ```'NA'```.

In [10]:
continents_groups = drinks.groupby('continent')
continents_groups.groups.keys()

dict_keys(['AF', 'AS', 'EU', 'NA', 'OC', 'SA'])

Calculam la mitjana de cervesa per grup.

In [11]:
beer_average=continents_groups[['beer_servings']].mean()
beer_average

           beer_servings
continent
AF             61.471698
AS             37.045455
EU            193.777778
NA            145.434783
OC             89.687500
SA            175.083333

Vegem quin és el màxim i a quin continent correspon.

In [12]:
beer_average_max=max(beer_average['beer_servings'])
beer_average[beer_average['beer_servings']==beer_average_max]

           beer_servings
continent
EU            193.777778

Així, el continent que beu més cervesa en mitjana és Europa.

### Step 5. For each continent print the statistics for wine consumption.

Donada la variable *continent_groups*, podem emprar la funció *describe()* per obtenir els estadístics del consum de vi per a cada continent.

In [13]:
continents_groups['wine_servings'].describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
NA          23.0   24.521739  28.266378  1.0   5.0   11.0   34.00  100.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

De nou, tenim que el continent amb un major consum de vi és Europa, però amb una alta variabilitat en el consum dels països que hi pertanyen.

### Step 6. Print the mean alcoohol consumption per continent for every column

Per obtenir la mitjana d'alcohol consumit segons cada columna per continent, basta executar la següent instrucció.

In [14]:
continents_groups.mean()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
NA,145.434783,165.739130,24.521739,5.995652
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

Notem que Europa té un major consum en totes les categories (columnes), excepte en _spirit_, que Amèrica del Nord en té més.

### Step 7. Print the median alcoohol consumption per continent for every column

De forma anàloga a l'**Step 6**, basta executar la següent instrucció.

In [15]:
continents_groups.median()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,32.0,3.0,2.0,2.30
AS,17.5,16.0,1.0,1.20
EU,219.0,122.0,128.0,10.00
NA,143.0,137.0,11.0,6.30
OC,52.5,37.0,8.5,1.75
SA,162.5,108.5,12.0,6.85

### Step 8. Print the mean, min and max values for spirit consumption.
#### This time output a DataFrame

Per obtenir un dataframe amb el valor mínim, màxim i la mitjana del consum d'_spirit_ per continent, podem emprar _agg()_ indicant quina columna volem modificar i quines funcions li volem aplicar.

In [16]:
continents_groups.agg({'spirit_servings': [min, np.mean, max]})

          spirit_servings
                      min        mean  max
continent
AF                      0   16.339623  152
AS                      0   60.840909  326
EU                      0  132.555556  373
NA                     68  165.739130  438
OC                      0   58.437500  254
SA                     25  114.750000  302

<br>
<br>